#include<stdio.h>

//补充知识：字符是以ASCll码值存储的，'0'的ASCll码值是48，然而‘’0-9‘’的ASCll码值连续，要获得整数值，就可以用
//        当前数字的ASCll码值-0的ASCll码值
int main()
{
    //C语言规定字符串的结束标志为“\0”，所以字符数组存储的字符串长度必须比字符数组少1字节
    char a[14];
    int cnt=0,ans,n=1;
    scanf("%s",a);
    //计算规则中不包含最后的识别码，值需要遍历之前的ISBN码即可
    //一共13位数字，只需要遍历11位数字，下标比物理位置少一
    for(int i=0;i<11;i++)  //遍历前11位
    {

        if(a[i]!='-'&&n<=9)
        {
            cnt+=(a[i]-'0')*n;
            n++;
        }
    }
    ans=cnt%11; //计算识别码
    //优先判断特殊的情况，余数为10，识别码是10
    if(ans==10)
    {
        if(a[12]=='X')//识别码物理位置是13，下标应该是12
        {
            printf("Right\n");
        }
        else
        {
            a[12]='X';
            printf("%s",a);
        }
    }
    else
    {
        if(a[12]==ans+'0')//这里又转化为ASCll码值，因为是字符数组
        {
            printf("Right\n");
        }
        else
        {
            a[12]=ans+'0';//易错：ans是整数，a数组的元素是字符，这里要强制类型转换
            printf("%s",a);
        }
    }
}