#include<stdio.h>
//易错：由于第二个题目条件是分开的两个区间，只要有一个区间不满足就达到了不符合第二个条件的要求
//提醒：！运算符的逻辑复杂，还涉及运算符优先级问题，容易造成逻辑混乱导致错误，才分区间单独判断可以覆盖全部情况
int main()
{
    int x;
    scanf("%d",&x);
    //小A
    if(x%2==0&&x>4&&x<=12)
    {
        printf("%d ",1);
    }
    else
    {
        printf("%d ",0);
    }
    //uim
    if(x%2==0||x>4&&x<=12||x%2==0&&x>4&&x<=12)//分类：一种（1或者2）；两种
    {
        printf("%d ",1);
    }
    else
    {
        printf("%d ",0);
    }
    //小B（主要问题是再小B的条件判断）
    if(x%2==0&&x<=4&&x>12||x%2!=0&&x>4&&x<=12)
    {
        printf("%d ",1);
    }
    else
    {
        printf("%d ",0);
    }
    //正妹
    //这里也易错：如果使用x%2!=&&x<=4&&x>12，那有哪个数是符合x<=4&&x>12的呢？
    if(x%2!=0&&x<=4||x%2!=0&&x>12)
    {
        printf("%d ",1);
    }
    else
    {
        printf("%d ",0);
    }
}